ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MPU_16_MPU_16_401C0000h.xml
	</register><register id="MPU_16_PROGRAMMABLE_7_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_7_END_ADDRESS" offset="612" width="32" description="Programmable_7_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_7_MPPA" acronym="MPU_16_PROGRAMMABLE_7_MPPA" offset="616" width="32" description="Programmable_7_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_8_START_ADDRESS" acronym="MPU_16_PROGRAMMABLE_8_START_ADDRESS" offset="624" width="32" description="Programmable_8_Start_Address.">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_8_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_8_END_ADDRESS" offset="628" width="32" description="Programmable_8_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_8_MPPA" acronym="MPU_16_PROGRAMMABLE_8_MPPA" offset="632" width="32" description="Programmable_8_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_9_START_ADDRESS" acronym="MPU_16_PROGRAMMABLE_9_START_ADDRESS" offset="640" width="32" description="Programmable_9_Start_Address.">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_9_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_9_END_ADDRESS" offset="644" width="32" description="Programmable_9_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_9_MPPA" acronym="MPU_16_PROGRAMMABLE_9_MPPA" offset="648" width="32" description="Programmable_9_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_10_START_ADDRESS" acronym="MPU_16_PROGRAMMABLE_10_START_ADDRESS" offset="656" width="32" description="Programmable_10_Start_Address.">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_10_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_10_END_ADDRESS" offset="660" width="32" description="Programmable_10_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_10_MPPA" acronym="MPU_16_PROGRAMMABLE_10_MPPA" offset="664" width="32" description="Programmable_10_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_11_START_ADDRESS" acronym="MPU_16_PROGRAMMABLE_11_START_ADDRESS" offset="672" width="32" description="Programmable_11_Start_Address.">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_11_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_11_END_ADDRESS" offset="676" width="32" description="Programmable_11_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_11_MPPA" acronym="MPU_16_PROGRAMMABLE_11_MPPA" offset="680" width="32" description="Programmable_11_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_12_START_ADDRESS" acronym="MPU_16_PROGRAMMABLE_12_START_ADDRESS" offset="688" width="32" description="Programmable_12_Start_Address.">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_12_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_12_END_ADDRESS" offset="692" width="32" description="Programmable_12_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_12_MPPA" acronym="MPU_16_PROGRAMMABLE_12_MPPA" offset="696" width="32" description="Programmable_12_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_13_START_ADDRESS" acronym="MPU_16_PROGRAMMABLE_13_START_ADDRESS" offset="704" width="32" description="Programmable_13_Start_Address.">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_13_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_13_END_ADDRESS" offset="708" width="32" description="Programmable_13_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_13_MPPA" acronym="MPU_16_PROGRAMMABLE_13_MPPA" offset="712" width="32" description="Programmable_13_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_14_START_ADDRESS" acronym="MPU_16_PROGRAMMABLE_14_START_ADDRESS" offset="720" width="32" description="Programmable_14_Start_Address.">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_14_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_14_END_ADDRESS" offset="724" width="32" description="Programmable_14_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_14_MPPA" acronym="MPU_16_PROGRAMMABLE_14_MPPA" offset="728" width="32" description="Programmable_14_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
