ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MPU_16_MPU_16_401C0000h.xml
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_15_START_ADDRESS" acronym="MPU_16_PROGRAMMABLE_15_START_ADDRESS" offset="736" width="32" description="Programmable_15_Start_Address.">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_15_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_15_END_ADDRESS" offset="740" width="32" description="Programmable_15_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_15_MPPA" acronym="MPU_16_PROGRAMMABLE_15_MPPA" offset="744" width="32" description="Programmable_15_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_16_START_ADDRESS" acronym="MPU_16_PROGRAMMABLE_16_START_ADDRESS" offset="752" width="32" description="Programmable_16_Start_Address.">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_16_END_ADDRESS" acronym="MPU_16_PROGRAMMABLE_16_END_ADDRESS" offset="756" width="32" description="Programmable_16_End_Address.">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31:0" rwaccess="R/W"/>
	</register><register id="MPU_16_PROGRAMMABLE_16_MPPA" acronym="MPU_16_PROGRAMMABLE_16_MPPA" offset="760" width="32" description="Programmable_16_MPPA.">
		<bitfield id="RESERVED3" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="LOCK" width="1" begin="28" end="28" resetval="0x0" description="this field is used for locking the corresponding MPU region configurations. Write 1 to lock the configurations along with the lock bit.Writing 1 is alllowed once per boot. Lock bit will clear on reset only.Once locked SW can not modify the MPU configurations along with lock bit. " range="28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0." range="27:26" rwaccess="R"/>
	<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25:10" rwaccess="R/W"/>
	<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure permission. Defaults to input value." range="7" rwaccess="R/W"/>
	<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="R/W"/>
	<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="R/W"/>
	<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="R/W"/>
	<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="R/W"/>
	<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="R/W"/>
	<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="R/W"/>
	<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="R/W"/>
	</register><register id="MPU_16_FAULT_ADDRESS" acronym="MPU_16_FAULT_ADDRESS" offset="768" width="32" description="Fault_Address.">
		<bitfield id="FAULT_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Fault_address." range="31:0" rwaccess="R"/>
	</register><register id="MPU_16_FAULT_STATUS" acronym="MPU_16_FAULT_STATUS" offset="772" width="32" description="Fault_Status.">
		<bitfield id="ID" width="8" begin="31" end="24" resetval="0x0" description="Transfer ID" range="31:24" rwaccess="R"/>
	<bitfield id="MSTID" width="8" begin="23" end="16" resetval="0x0" description="Master ID." range="23:16" rwaccess="R"/>
	<bitfield id="RESERVED" width="3" begin="15" end="13" resetval="0x0" description="Always read as 0." range="15:13" rwaccess="R"/>
	<bitfield id="PRIVID" width="4" begin="12" end="9" resetval="0x0" description="Privilege ID." range="12:9" rwaccess="R"/>
	<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="R"/>
	<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure access." range="7" rwaccess="R"/>
	<bitfield id="RESERVED2" width="1" begin="6" end="6" resetval="0x0" description="Always read as 0." range="6" rwaccess="R"/>
	<bitfield id="FAULT_TYPE" width="6" begin="5" end="0" resetval="0x0" description="Fault_type.100000 = supervisor read fault010000 = supervisor write fault001000 = supervisor execute fault000100 = user read fault000010 = user write fault000001 = user execute fault111111 = relaxed cache linefill fault010010 = relaxed cache writeback fault000000 = no fault" range="5:0" rwaccess="R"/>
	</register><register id="MPU_16_FAULT_CLEAR" acronym="MPU_16_FAULT_CLEAR" offset="776" width="32" description="Fault_Clear.">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Always read as 0." range="31:1" rwaccess="R"/>
	<bitfield id="FAULT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Fault_clear. Writing a 1 clears the current fault. Writing a0 has no effect." range="0" rwaccess="W"/>
	</register>
</module>